info_anketa = [
    (1, 'Иван', 'Черных', '1988-02-27', 'м', '2000-12-15', 'Грузчик', 'Отдел транпортировок', 45000),
    (2, 'Алексей', 'Ложкин', '1990-12-02', 'м', '2006-03-23', 'Менеджер', 'Отдел продаж', 23000),
    (3, 'Наталья', 'Калмыкова', '1947-06-15', 'ж', '2008-12-15', 'Программист', 'Отдел IT', 123000),
    (4, 'Ирина', 'Белова', '2000-08-31', 'ж', '2018-03-08', 'Дизайнер', 'Отдел дизайна', 88000),
    (5, 'Руслан', 'Петров', '1950-04-01', 'м', '1993-02-01', 'Охранник', 'Отдел безопасности', 92000),
    (6, 'Светлана', 'Виноградова', '2015-08-31', 'ж', '2018-03-08', 'Системный администратор', 'Отдел IT', 130000),
    (7, 'Сергей', 'Соседко', '2000-08-23', 'м', '2022-03-08', 'Менеджер', 'Администрация', 12000),
    (42, 'Олег', 'Белов', '1923-07-01', 'м', '1950-03-08', 'Главный бухгалтер', 'Бухгалтерия', 23000),
    (8, 'Евгений', 'Камилов', '1986-01-31', 'м', '1956-12-31', 'Медбрат', 'Терапевтический отдел', 10000),
    (9, 'Карина', 'Королева', '2005-03-13', 'ж', '2006-03-13', 'Финансист', 'Отдел финансов', 197000),
    (10, 'Никита', 'Бозюков', '1901-01-01', 'м', '2000-01-01', 'Охранник', 'Отдел безопасности', 500000),
    (11, 'Михаил', 'Топтыгин', '1993-12-13', 'м', '2006-03-24', 'Менеджер', 'Отдел финансов', 15000)
]

info_list = [
    (1, 3, '2022-03-12', '2022-03-15', 'Травма', 'Перелом голени', 1),
    (2, 42, '2022-05-13', '2022-08-31', 'Болезнь', 'ОРВИ', 0),
    (3, 7, '2022-09-01', '2022-09-01', 'Остановка сердца', 'Смерть', 0),
    (4, 42, '2020-12-31', '2022-01-01', 'Шаурма', 'Отравление', 1),
    (5, 8, '2023-02-02', '2023-03-23', 'Болень', 'Коронавирус', 1),
    (6, 11, '2020-07-12', '2022-08-01', 'Травма', 'Сотрясение мозга', 0),
    (7, 5, '2019-02-13', '2019-09-01', 'Обморожение', 'Ампутация руки', 0),
    (8, 1, '2020-09-23', '2022-05-12', 'Болезнь', 'Ветрянка', 1),
    (9, 3, '2013-05-01', '2013-05-15', 'Отравление', 'Укус комара', 1),
    (10, 11, '2022-09-02', '2022-09-18', 'Болезнь', 'Заболевание почек', 0),
    (11, 4, '2012-02-08', '2012-02-16', 'Болезнь', 'Сахарный диабет', 0)
]